In [5]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

log = pd.read_csv('log.csv.xls', encoding='utf-8', header=None)
user = pd.read_csv('users.csv.xls', encoding='koi8_r', sep='\t', header=None)

log.columns = ['user_id', 'time', 'bet', 'win']
user.columns = ['user_id', 'email', 'geo']

def correct_id(user):
    if '#error' in user:
        return ''
    else:
        return user[user.find("user"):]
log.user_id = log.user_id.apply(correct_id)
log.time = log.time.str.replace('[', '')

In [129]:
log.head()

    user_id                 time  bet  win
0  user_919  2019-01-01 14:06:51  NaN  NaN
1  user_973  2019-01-01 14:51:16  NaN  NaN
2  user_903  2019-01-01 16:31:16  NaN  NaN
3  user_954  2019-01-01 17:17:51  NaN  NaN
4  user_954  2019-01-01 21:31:18  NaN  NaN

In [130]:
user.head()

    user_id                email        geo
0    Юзверь                 мейл        Гео
1  User_943  Accumanst@gmail.com     Ижевск
2  User_908    Advismowr@mail.ru     Ижевск
3  User_962      Anachso@ukr.net  Краснодар
4  User_973     Antecia@inbox.ru      Пермь

In [131]:
def isna(col):
    c=0
    for i in log[col].isna():
        if i==True:
            c+=1
    return c
isna('time')

15

In [132]:
log.dropna(axis=0)

      user_id                 time        bet        win
14   user_917   2019-01-02 8:57:36   145732.0  1987653.0
29   user_942  2019-01-04 13:59:42  1678321.0  9876543.0
151  user_982  2019-01-16 21:54:22      100.0     4749.0
189  user_964  2019-01-21 18:34:44      200.0     4667.0
205  user_931   2019-01-22 5:26:59      300.0     4319.0
..        ...                  ...        ...        ...
967  user_975  2019-04-19 22:25:15     1000.0     6108.0
971  user_912  2019-04-20 10:35:49    10554.0    31799.0
972  user_926  2019-04-20 10:35:50    10354.0    30244.0
976  user_970  2019-04-20 10:35:54    10354.0    30691.0
991  user_965  2019-04-20 12:55:41      800.0     6927.0

[133 rows x 4 columns]

In [133]:
isna('time')

15

In [134]:
log.drop_duplicates(subset=['time', 'user_id'])

      user_id                 time      bet     win
0    user_919  2019-01-01 14:06:51      NaN     NaN
1    user_973  2019-01-01 14:51:16      NaN     NaN
2    user_903  2019-01-01 16:31:16      NaN     NaN
3    user_954  2019-01-01 17:17:51      NaN     NaN
4    user_954  2019-01-01 21:31:18      NaN     NaN
..        ...                  ...      ...     ...
991  user_965  2019-04-20 12:55:41    800.0  6927.0
992  user_967  2019-04-20 14:59:36  10154.0     NaN
993  user_973  2019-04-20 17:09:56  10254.0     NaN
994  user_977  2019-04-20 18:10:07  10354.0     NaN
995  user_984   2019-04-20 9:59:58   9754.0     NaN

[986 rows x 4 columns]

In [135]:
def time_normalize(row):
#     date_format=
    for i in row:
        date_format = datetime.strptime(i, '%Y-%m-%d')
        i = date_format

In [136]:
log.time = pd.to_datetime(log.time, format='%Y-%m-%d %H:%M:%S')

In [137]:
log

      user_id                time      bet      win
0    user_919 2019-01-01 14:06:51      NaN      NaN
1    user_973 2019-01-01 14:51:16      NaN      NaN
2    user_903 2019-01-01 16:31:16      NaN      NaN
3    user_954 2019-01-01 17:17:51      NaN      NaN
4    user_954 2019-01-01 21:31:18      NaN      NaN
..        ...                 ...      ...      ...
995  user_984 2019-04-20 09:59:58   9754.0      NaN
996                           NaT  10054.0  29265.0
997                           NaT  10454.0      NaN
998                           NaT   1000.0      NaN
999                           NaT  10754.0      NaN

[1000 rows x 4 columns]

In [138]:
# log = log.dropna()  
# log.columns = ['user_id', 'time', 'bet', 'win']  
# # log['time'] = log['time'].apply(lambda x: x[1:])  
# log['time'] = pd.to_datetime(log['time'], format='%Y-%m-%d %H:%M:%S')  
# log['time'] = log['time'].apply(lambda x: x.minute)  
# log['time'].head()

In [139]:
year_column = log.time.apply(lambda x: x.year)

In [140]:
year_column = log.time.dt.year
# year_column

Аксессор - это атрибут столбца, который хранит переменные типа Timestamp, то есть переменные, которые были строковым представлением времени, а затем изменены с помощью pd.to_datetime(). Если вы попытаетесь обратиться к dt у столбца, в котором лежит что-то отличное от времени, вы получите ошибку.

In [141]:
min_col = log.time.dt.minute
min_col.value_counts().head()

36.0    25
31.0    23
6.0     22
50.0    22
14.0    21
Name: time, dtype: int64

In [142]:
month_col = log.time.dt.month
month_col.value_counts(ascending=True).head()

4.0    170
2.0    259
3.0    264
1.0    292
Name: time, dtype: int64

In [143]:
day_col = log.time.dt.dayofweek
day_col
count = day_col.value_counts()
count

5.0    152
2.0    150
1.0    150
0.0    135
4.0    135
3.0    132
6.0    131
Name: time, dtype: int64

In [144]:
def time_to_day(t):
    if (t.hour >= 0 and t.hour <= 5):
        return 'Night'
    if (t.hour >= 6 and t.hour <= 11):
        return 'Morning'
    if (t.hour >= 12 and t.hour <= 17):
        return 'Day'
    if (t.hour >= 18 and t.hour <= 23):
        return 'Evening'
    
log['day_time'] = log.time.apply(time_to_day)

In [145]:
log.day_time.value_counts(ascending=True)

Evening    227
Day        240
Morning    253
Night      265
Name: day_time, dtype: int64

In [146]:
log = pd.read_csv('log.csv.xls', encoding='utf-8', header=None)
log.columns = ['user_id', 'time', 'bet', 'win']
log.user_id = log.user_id.apply(correct_id)
log.time = log.time.str.replace('[', '')
log.dropna(axis=0)
log.time = pd.to_datetime(log.time)
log['hour'] = log.time.dt.hour

In [147]:
log

      user_id                time      bet      win  hour
0    user_919 2019-01-01 14:06:51      NaN      NaN  14.0
1    user_973 2019-01-01 14:51:16      NaN      NaN  14.0
2    user_903 2019-01-01 16:31:16      NaN      NaN  16.0
3    user_954 2019-01-01 17:17:51      NaN      NaN  17.0
4    user_954 2019-01-01 21:31:18      NaN      NaN  21.0
..        ...                 ...      ...      ...   ...
995  user_984 2019-04-20 09:59:58   9754.0      NaN   9.0
996                           NaT  10054.0  29265.0   NaN
997                           NaT  10454.0      NaN   NaN
998                           NaT   1000.0      NaN   NaN
999                           NaT  10754.0      NaN   NaN

[1000 rows x 5 columns]

In [148]:
log.bet = log['bet'].fillna(0)
log.bet.value_counts().head()

0.0      515
500.0     50
100.0     48
300.0     42
800.0     42
Name: bet, dtype: int64

In [149]:
def fillna_win(row):
    if (row.loc['bet'] > 0 and pd.isnull(row.loc['win'])): 
        row.loc['win'] = -row.loc['bet']
    if (row.loc['bet'] == 0 and pd.isnull(row.loc['win'])):
        row.loc['win'] = 0
    return row
    
new_win = log.apply(lambda row: fillna_win(row), axis=1)

In [150]:
log = new_win

In [151]:
def fill_net(row):
    if row.loc['win'] < 0:
        row.loc['net'] = row.loc['win']
    else:
        row.loc['net'] = row.loc['win']-row.loc['bet']
    return row.loc['net']


log['net'] = 0
log.net = log.apply(lambda row: fill_net(row), axis=1)

In [152]:
log[log.net>0].net.median()
# log = pd.read_csv('log.csv.xls', encoding='utf-8', header=None)

5347.0

In [153]:
len(log[log.bet>0])/len(log)

0.485

In [154]:
log[log.win<0].net.mean()

-3372.743515850144

In [155]:
len(log[(log.bet>0)&(log.win>0)])/len(log)

0.138

In [156]:
log[log.bet == 100].count()

user_id    48
time       48
bet        48
win        48
hour       48
net        48
dtype: int64

In [157]:
log[log.bet>0].bet.min()

100.0

In [158]:
user.user_id = user.user_id.apply(lambda x: x.lower())

In [159]:
log = log[log.user_id != '#error']
user  = user.apply(lambda x: x[1:])

In [161]:
user

      user_id                     email          geo
1    user_943       Accumanst@gmail.com       Ижевск
2    user_908         Advismowr@mail.ru       Ижевск
3    user_962           Anachso@ukr.net    Краснодар
4    user_973          Antecia@inbox.ru        Пермь
5    user_902        Balliaryva@ukr.net          NaN
..        ...                       ...          ...
96   user_959  UpdatesCurious@yahoo.com       Тюмень
97   user_901        V2artierso@mail.ru  Арзангелтск
98   user_970          Vashoterlo@bk.ru      Воронеж
99   user_965       Visuareda@yahoo.com      Воронеж
100  user_921              Aavast@ya.ru       Ижевск

[100 rows x 3 columns]

In [168]:
df = pd.merge(user, log, on='user_id')
df

,user_id,email,geo,time,bet,win,hour,net
0,user_943,Accumanst@gmail.com,Ижевск,2019-01-06 21:06:57,0.0,0.0,21.0,0.0
1,user_943,Accumanst@gmail.com,Ижевск,2019-01-10 12:16:22,100.0,-100.0,12.0,-100.0
2,user_943,Accumanst@gmail.com,Ижевск,2019-01-27 01:18:47,100.0,-100.0,1.0,-100.0
3,user_943,Accumanst@gmail.com,Ижевск,2019-02-10 11:09:24,100.0,5456.0,11.0,5356.0
4,user_943,Accumanst@gmail.com,Ижевск,2019-02-12 15:09:38,300.0,5245.0,15.0,4945.0
...,...,...,...,...,...,...,...,...
970,user_965,Visuareda@yahoo.com,Воронеж,2019-04-20 12:55:41,800.0,6927.0,12.0,6127.0
971,user_921,Aavast@ya.ru,Ижевск,2019-01-07 01:05:59,0.0,0.0,1.0,0.0
972,user_921,Aavast@ya.ru,Ижевск,2019-02-05 14:08:57,0.0,0.0,14.0,0.0
973,user_921,Aavast@ya.ru,Ижевск,2019-02-09 23:20:21,400.0,6067.0,23.0,5667.0
974,user_921,Aavast@ya.ru,Ижевск,2019-02-10 17:53:37,900.0,-900.0,17.0,-900.0

In [171]:
df.groupby('user_id').win.median().median()

0.0

In [172]:
df.groupby('user_id').net.sum().median()

1986.0

In [178]:
(df[df.bet==0].groupby('user_id').bet.count())/

user_id
user_1000    8
user_900     6
user_901     6
user_902     4
user_903     4
            ..
user_995     4
user_996     2
user_997     4
user_998     3
user_999     5
Name: bet, Length: 100, dtype: int64

In [179]:
def get_bet_zero(bet):
    if bet.sum() > 0:
        a=bet.value_counts()
        return a[0]
    else:
        return 0
    
    
user_data = df.groupby('user_id')
bet_data = user_data.bet.apply(get_bet_zero)
bet_data.mean()

5.05

In [184]:
df.groupby('user_id').bet.sum()

user_id
user_1000     1600.0
user_900      3800.0
user_901       600.0
user_902      1700.0
user_903     13554.0
              ...
user_995     12854.0
user_996      1000.0
user_997      1200.0
user_998     15554.0
user_999      1600.0
Name: bet, Length: 100, dtype: float64

In [185]:
time_min = df[df.bet==0].groupby('user_id').time.min()
time_min_not_null = df[df.bet>0].groupby('user_id').time.min()

In [189]:
joined = pd.merge(time_min, time_min_not_null, on='user_id')
joined['delta'] = joined['time_y'] - joined['time_x']

In [191]:
joined.delta.sum().days/joined.delta.count()

46.28

In [192]:
df

,user_id,email,geo,time,bet,win,hour,net
0,user_943,Accumanst@gmail.com,Ижевск,2019-01-06 21:06:57,0.0,0.0,21.0,0.0
1,user_943,Accumanst@gmail.com,Ижевск,2019-01-10 12:16:22,100.0,-100.0,12.0,-100.0
2,user_943,Accumanst@gmail.com,Ижевск,2019-01-27 01:18:47,100.0,-100.0,1.0,-100.0
3,user_943,Accumanst@gmail.com,Ижевск,2019-02-10 11:09:24,100.0,5456.0,11.0,5356.0
4,user_943,Accumanst@gmail.com,Ижевск,2019-02-12 15:09:38,300.0,5245.0,15.0,4945.0
...,...,...,...,...,...,...,...,...
970,user_965,Visuareda@yahoo.com,Воронеж,2019-04-20 12:55:41,800.0,6927.0,12.0,6127.0
971,user_921,Aavast@ya.ru,Ижевск,2019-01-07 01:05:59,0.0,0.0,1.0,0.0
972,user_921,Aavast@ya.ru,Ижевск,2019-02-05 14:08:57,0.0,0.0,14.0,0.0
973,user_921,Aavast@ya.ru,Ижевск,2019-02-09 23:20:21,400.0,6067.0,23.0,5667.0
974,user_921,Aavast@ya.ru,Ижевск,2019-02-10 17:53:37,900.0,-900.0,17.0,-900.0

In [196]:
df.groupby('geo').win.sum()

geo
Арзангелтск           25813.0
Воронеж              107514.0
Екатеринбург          28582.0
Ижевск                34479.0
Казань                75352.0
Краснодар              3248.0
Красноярск            27397.0
Москва             11379755.0
Пермь                 19518.0
Санкт-Петербург      105345.0
Ставрополь              487.0
Тюмень                 -499.0
Хабаровск             33451.0
Ярославль             46845.0
Name: win, dtype: float64

In [203]:
df[df.bet>0].groupby('geo').bet.mean().max()

62240.846153846156

In [205]:
62240.846153846156/486.95652173913044

127.81602335164835

In [204]:
df[df.bet>0].groupby('geo').bet.mean().min()

486.95652173913044

In [207]:
df.groupby('geo').user_id.count()

geo
Арзангелтск         96
Воронеж             88
Екатеринбург        49
Ижевск              61
Казань              66
Краснодар           86
Красноярск          56
Москва              61
Пермь               55
Санкт-Петербург    115
Ставрополь          36
Тюмень              32
Хабаровск           60
Ярославль           89
Name: user_id, dtype: int64

In [210]:
log.time.apply(lam)

TypeError: 'Series' object is not callable

In [9]:
lis1t = pd.DataFrame([1/27, 2/9, 4/9, 8/27])
lis1t.quantile(0.25)

0    0.175926
Name: 0.25, dtype: float64